package lab6.Task3;

public class Main {
    public static void main(String[] args) {

        Task3.maxValue(51,20,-159,56,235,-1239);
        Task3.minValue(43,50,0,-25,333,-55,86,1);
        Task3.averageValue(33,10,5,2,-33,45,66,17);

    }
}

/*
Напишите программу с классом, в котором есть статические
методы, которым можно передавать произвольное количество
целочисленных аргументов (или целочисленный массив).
Методы, на основании переданных аргументов или массива,
позволяют вычислить: наибольшее значение, наименьшее значение,
а также среднее значение из набора чисел
 */